
## Plan Result




<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_action_group.action_group
  * module.application_insights.azurerm_monitor_activity_log_alert.main
* Update
  * module.finalsa_storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "other"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "pre-stg-appinsights"
      + resource_group_name                   = "pre-stg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
    }

  # module.application_insights.azurerm_monitor_action_group.action_group will be created
  + resource "azurerm_monitor_action_group" "action_group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Pre-Stg-Warning-Alerts"
      + resource_group_name = "pre-stg"
      + short_name          = "pre-stg"
      + tags                = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + azure_function_receiver {
          + function_app_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/sds-alerts-slack-stg/providers/Microsoft.Web/sites/sds-alerts-slack-stg"
          + function_name            = "httpTrigger"
          + http_trigger_url         = (sensitive value)
          + name                     = "slack-alerts"
          + use_common_alert_schema  = true
        }
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + name                = "Application Insights daily cap reached"
      + resource_group_name = "pre-stg"
      + scopes              = (known after apply)
      + tags                = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + action {
          + action_group_id    = (known after apply)
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C02F3N771U7"
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)
        }
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.109.148",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":712,"Program":"tfcmt","SHA1":"","Vars":{}} -->